Repository: dr1lan/custom-scanner
Catalog: wapitiCore/language_sources/*.po
Languages: ru

source: Found backup file {}
ru: Найдены резервные копии {}

source: Backup file {0} found for {1}
ru: Найдена резервная копия {0} для {1}

source: Credentials found for URL {} : {} / {}
ru: Найдены учетные данные для URL {}: {} / {}

source: HttpOnly flag is not set in the cookie : {0}
ru: В cookie не установлен флаг HttpOnly: {0}

source: Secure flag is not set in the cookie : {0}
ru: В cookie не установлен флаг Secure: {0}

source: Checking cookie : {}
ru: Проверка cookie: {}

source: CRLF Injection
ru: CRLF (Carriage Return Line Feed) инъекция

source: Error: The server did not understand this request
ru: Ошибка: сервер не понял этот запрос

source: {0} via injection in the parameter {1}
ru: {0} с использованием инъекции в параметре {1}

source: CSP is not set
ru: CSP (Content Security Policy) не установлен

source: CSP attribute "{0}" is missing
ru: Атрибут CSP (Content Security Policy) "{0}" отсутствует

source: CSP "{0}" value is not safe
ru: Значение CSP (Content Security Policy) "{0}" небезопасно

source: Lack of anti CSRF token
ru: Отсутствует токен для защиты от CSRF (Cross-Site Request Forgery)

source: CSRF token '{}' is not properly checked in backend
ru: Токен CSRF '{}' не проверен должным образом на бэкенде

source: CSRF token '{}' might be easy to predict
ru: Токен CSRF '{}' легко угадать

source: {0} {1} detected
ru: Обнаружено {0} {1}

source: No Drupal Detected
ru: Drupal не обнаружен

source: Warning eval()
ru: Предупреждение: найдено использование eval()

source: Command execution
ru: Выполнение команды

source: PHP evaluation
ru: Оценивание выполнения PHP скриптов

source: Warning exec
ru: Предупреждение: найдено использование exec

source: preg_replace injection
ru: preg_replace() инъекция

source: Warning usort()
ru: Предупреждение: usort() может вызвать повреждение памяти

source: Warning assert
ru: Предупреждение: assert() уязвим для включения локальных файлов

source: Evaluation warning
ru: Оценивание возникновения предупреждений

source: Blind command execution
ru: "Слепое" внедрение комманд

source: Possible {0} vulnerability
ru: Возможная {0} уязвимость

source: Constraints: {}
ru: Ограничения: {}

source: {0} bypassable weak restriction
ru: {0} можно обойти слабое ограничение

source: Weak restriction bypass vulnerability: {0}
ru: Уязвимость может обойти слабое ограничение: {0}

source: HTTP status code changed from {0} to {1}
ru: Код статуса HTTP изменен с {0} на {1}

source: Source code:
ru: Исходный код:

source: Strict-Transport-Security is not set
ru: Заголовок Strict-Transport-Security не установлен

source: X-Content-Type-Options is not set
ru: Заголовок X-Content-Type-Options не установлен

source: X-XSS-Protection is not set
ru: Заголовок X-XSS-Protection не установлен

source: X-Frame-Options is not set
ru: Заголовок X-Frame-Options не установлен

source: Checking X-Frame-Options :
ru: Проверка заголовка X-Frame-Options:

source: Checking X-XSS-Protection :
ru: Проверка заголовка X-XSS-Protection :

source: Checking X-Content-Type-Options :
ru: Проверка заголовка X-Content-Type-Options :

source: Checking Strict-Transport-Security :
ru: Проверка заголовка Strict-Transport-Security :

source: Interesting methods allowed on {}: {}
ru: Интересные методы разрешены на {}: {}

source: Error downloading nikto database.
ru: Ошибка при загрузке базы данных nikto.

source: Problem with local nikto database.
ru: Проблема с локальной базой данных nikto.

source: Downloading from the web...
ru: Загрузка из Интернета...

source: References:
ru: Ссылки:

source: Stored XSS vulnerability
ru: Сохраненная уязвимость XSS

source: Permanent XSS vulnerability found via injection in the parameter {0}
ru: Постоянная уязвимость XSS обнаружена путем внедрения в параметр {0}

source: Permanent XSS vulnerability found in {0} by injecting the parameter {1} of {2}
ru: Постоянная уязвимость XSS обнаружена в {0} путем внедрения параметра {1} из {2}

source: Warning: Content-Security-Policy is present!
ru: Внимание! Присутствует Content-Security-Policy!

source: Open Redirect
ru: Открытое перенаправление

source: URL {0} seems vulnerable to Shellshock attack!
ru: URL {0} кажется уязвимым для атаки Shellshock!

source: URL {0} seems vulnerable to Shellshock attack
ru: URL {0} кажется уязвимым для атаки Shellshock

source: SQL Injection
ru: SQL-инъекция

source: .NET SQL Injection
ru: Инъекция .NET SQL

source: Spring JDBC Injection
ru: Spring JDBC инъекция

source: XPath Injection
ru: XPath инъекция

source: LDAP Injection
ru: LDAP инъекция

source: SSRF vulnerability
ru: SSRF уязвимость

source: [*] Asking endpoint URL {} for results, please wait...
ru: [*] Запрос результатов по URL-адресу {}, подождите...

source: [!] Unable to request endpoint URL '{}'
ru: [!] Невозможно запросить URL-адрес '{}'

source: {0} via injection in the parameter {1}. The target performed an outgoing HTTP {2} request at {3} with IP {4}. Full request can be seen at {5}
ru: {0} путем внедрения в параметр {1}. Цель выполнила исходящий HTTP-запрос {2} в {3} с IP {4}. Полный запрос можно увидеть на {5}

source: Record {domain} points to {cname}
ru: Запись {domain} указывает на {cname}

source: CNAME {domain} to {cname} seems vulnerable to takeover
ru: CNAME {domain} для {cname} кажется уязвимым для захвата

source: Blind SQL vulnerability
ru: "Слепая" уязвимость SQL

source: Error downloading wapp database.
ru: Ошибка при загрузке базы данных wapp.

source: Problem with local wapp database.
ru: Проблема с локальной базой данных wapp.

source: Try using --store-session option, or update apps.json using --update option.
ru: Попробуйте использовать параметр --store-session или обновите apps.json с помощью параметра --update.

source: No WordPress Detected
ru: WordPress не обнаружен

source: Enumeration of WordPress Plugins :
ru: Перечень плагинов WordPress:

source: Enumeration of WordPress Themes :
ru: Перечень тем WordPress:

source: XSS vulnerability
ru: XSS уязвимость

source: XSS vulnerability found via injection in the parameter {0}
ru: Уязвимость XSS обнаружена путем внедрения в параметр {0}

source: XXE vulnerability
ru: XXE уязвимость

source: Out-Of-Band {0} by sending raw XML in request body
ru: Out-Of-Band {0} путем отправки необработанного XML в теле запроса

source: Out-Of-Band {0} via injection in the parameter {1}
ru: Out-Of-Band {0} с помощью инъекции в параметр {1}

source: The target sent {0} bytes of data to the endpoint at {1} with IP {2}. Received data can be seen at {3}.
ru: Целевой объект отправил {0} байт данных в конечную точку в {1} с IP-адресом {2}. Полученные данные можно увидеть на странице {3}.

source: Backup file
ru: Файл резервной копии

source: It may be possible to find backup files of scripts on the webserver that the web-admin put here to save a previous version or backup files that are automatically generated by the software editor used (like for example Emacs).
ru: Есть вероятность найти резервные копии скриптов на веб-сервере, которые веб-администратор поместил сюда для сохранения предыдущей версии, или резервные копии, которые автоматически генерируются используемым программным редактором (например, Emacs).

source: These copies may reveal interesting information like source code or credentials.
ru: Эти копии могут содержать интересную информацию, такую ​​как исходный код или учетные данные.

source: The webadmin must manually delete the backup files or remove it from the web root.
ru: Веб-администратор должен вручную удалить резервные копии или удалить их из корневого каталога web.

source: He should also reconfigure its editor to deactivate automatic backups.
ru: Ему также следует перенастроить свой редактор, чтобы отключить автоматическое резервное копирование.

source: Weak credentials
ru: Слабые учетные данные

source: The web application is using either default credentials or weak passwords that can be found in well-known passwords lists.
ru: Веб-приложение использует учетные данные по умолчанию, либо слабые пароли, которые можно найти в хорошо известных списках паролей.

source: Do not ship or deploy with any default credentials, particularly for admin users.
ru: Не разворачивайте проект с учетными данными по умолчанию, особенно для пользователей-администраторов.

source: Implement weak-password checks, such as testing new or changed passwords against a list of the top 10000 worst passwords.
ru: Внедрите проверку ненадежных паролей, например проверку новых или измененных паролей по списку из 10000 самых плохих паролей.

source: The term CRLF refers to Carriage Return (ASCII 13, \r) Line Feed (ASCII 10, \n).
ru: Термин CRLF относится к переводу строки (ASCII 13, \ r) возврата каретки (ASCII 13, \ r) (ASCII 10, \ n).

source: A CRLF Injection attack occurs when a user manages to submit a CRLF into an application.
ru: Атака CRLF Injection происходит, когда пользователю удается отправить CRLF в приложение.

source: This is most commonly done by modifying an HTTP parameter or URL.
ru: Чаще всего это делается путем изменения параметра HTTP или URL-адреса.

source: Check the submitted parameters and do not allow CRLF to be injected when it is not expected.
ru: Проверяйте отправленные параметры и не позволяйте вводить CRLF, когда это не ожидается.

source: Content Security Policy Configuration
ru: Конфигурация политики безопасности контента

source: CSP Configuration
ru: Конфигурация политики безопасности контента

source: Content Security Policy (CSP) is an added layer of security that helps to detect and mitigate certain types of attacks, including Cross Site Scripting (XSS) and data injection attacks.
ru: Политика безопасности контента (CSP) - это дополнительный уровень безопасности, который помогает обнаруживать и уменьшать влияние определенных типов атак, включая атаки с использованием межсайтовых сценариев (XSS) и инъекции в данных.

source: Configuring Content Security Policy involves adding the Content-Security-Policy HTTP header to a web page and giving it values to control what resources the user agent is allowed to load for that page.
ru: Настройка политики безопасности контента включает добавление HTTP-заголовка Content-Security-Policy на веб-страницу и присвоение ему значений для управления ресурсами, которые разрешено загружать пользовательскому агенту для этой страницы.

source: Cross Site Request Forgery
ru: Подделка межсайтовых запросов

source: Cross-Site Request Forgery (CSRF) is an attack that forces an end user to execute unwanted actions on a web application in which they're currently authenticated.
ru: Подделка межсайтовых запросов (CSRF) - это атака, вынуждающая конечного пользователя выполнять нежелательные действия в веб-приложении, в котором он в настоящее время аутентифицирован.

source: Check if your framework has built-in CSRF protection and use it.
ru: Проверьте, есть ли в вашем фреймворке встроенная защита от CSRF, и используйте ее.

source: If framework does not have built-in CSRF protection add CSRF tokens to all state changing requests (requests that cause actions on the site) and validate them on backend.
ru: Если фреймворк не имеет встроенной защиты CSRF, добавьте токены CSRF ко всем запросам на изменение состояния (запросы, вызываемые действиями на сайте) и проверяйте их на бэкэнде.

source: Potentially dangerous file
ru: Потенциально опасный файл

source: A file with potential vulnerabilities has been found on the website.
ru: На сайте обнаружен файл с потенциальными уязвимостями.

source: Make sure the script is up-to-date and restrict access to it if possible.
ru: Убедитесь, что скрипт актуален, и, если возможно, ограничьте к нему доступ.

source: This attack consists in executing system commands on the server.
ru: Эта атака заключается в выполнении системных команд на сервере.

source: The attacker tries to inject this commands in the request parameters.
ru: Атакующий пытается ввести эти команды в параметры запроса.

source: Prefer working without user input when using file system calls.
ru: При использовании вызовов файловой системы предпочитайте работу без ввода данных пользователем.

source: Path Traversal
ru: Атака с обходом каталогов

source: This attack is known as Path or Directory Traversal.
ru: Эта атака известна как обход пути или каталога.

source: Its aim is the access to files and directories that are stored outside the web root folder.
ru: Цель атаки - доступ к файлам и каталогам, которые хранятся вне корневой папки web.

source: The attacker tries to explore the directories stored in the web server.
ru: Злоумышленник пытается исследовать каталоги, хранящиеся на веб-сервере.

source: Use indexes rather than actual portions of file names when templating or using language files (eg: value 5 from the user submission = Czechoslovakian, rather than expecting the user to return 'Czechoslovakian').
ru: Используйте индексы, а не фактические части имен файлов при создании шаблонов или использовании языковых файлов (например: значение 5 из пользовательской формы = чехословацкий, вместо того, чтобы ожидать, что пользователь вернет «чехословацкий»).

source: Ensure the user cannot supply all parts of the path - surround it with your path code.
ru: Убедитесь, что пользователь не может указать все части пути - оберните его в коде своим путем.

source: Validate the user's input by only accepting known good - do not sanitize the data.
ru: Подтвердите ввод пользователя, приняв только заведомо исправные - не исправляйте данные.

source: Use chrooted jails and code access policies to restrict where the files can be obtained or saved to.
ru: Используйте chroot jail и политики доступа к коду, чтобы ограничить, где файлы могут быть получены или сохранены.

source: Fingerprint web technology
ru: Цифровой отпечаток устройства (фингерпринт)

source: The use of a web technology can be deducted due to the presence of its specific fingerprints.
ru: Использование определенной веб-технологии может быть вычислено из-за наличия определенных цифровых отпечатков.

source: This is only for informational purposes.
ru: Это только в информационных целях.

source: Fingerprint web application framework
ru: Цифровой отпечаток фреймворка веб приложения

source: The version of a web application framework can be identified due to the presence of its specific fingerprints.
ru: Версию фреймворка веб-приложения можно определить по его специфическим цифровым отпечаткам.

source: Fingerprint web server
ru: Цифровой отпечаток веб-сервера

source: The version of a web server can be identified due to the presence of its specific fingerprints.
ru: Версию веб-сервера можно определить по его специфическим цифровым отпечаткам.

source: Htaccess Bypass
ru: Обход Htaccess

source: Htaccess files are used to restrict access to some files or HTTP method.
ru: Файлы Htaccess используются для ограничения доступа к некоторым файлам или HTTP методам.

source: In some case it may be possible to bypass this restriction and access the files.
ru: В некоторых случаях можно обойти это ограничение и получить доступ к файлам.

source: Make sure every HTTP method is forbidden if the credentials are bad.
ru: Убедитесь, что все методы HTTP запрещены, если учетные данные неверны.

source: HTTP Secure Headers
ru: HTTP заголовки безопасности

source: HTTP security headers tell the browser how to behave when handling the website's content.
ru: Заголовки безопасности HTTP сообщают браузеру, как вести себя при обработке содержимого веб-сайта.

source: Use the recommendations for hardening your HTTP Security Headers.
ru: Используйте рекомендации по усилению заголовков безопасности HTTP.

source: HttpOnly Flag cookie
ru: Флаг HttpOnly cookie

source: HttpOnly is an additional flag included in a Set-Cookie HTTP response header.
ru: HttpOnly - это дополнительный флаг, включенный в заголовок HTTP-ответа Set-Cookie.

source: Using the HttpOnly flag when generating a cookie helps mitigate the risk of client side script accessing the protected cookie (if the browser supports it).
ru: Использование флага HttpOnly при создании файла cookie помогает снизить риск доступа скрипта на стороне клиента к защищенному файлу cookie (если браузер поддерживает его).

source: While creation of the cookie, make sure to set the HttpOnly Flag to True.
ru: При создании файла cookie убедитесь, что для флага HttpOnly установлено значение True.

source: Internal Server Error
ru: Внутренняя ошибка сервера

source: An error occurred on the server's side, preventing it to process the request.
ru: Произошла ошибка на стороне сервера, не позволяющая обработать запрос.

source: It may be the sign of a vulnerability.
ru: Это может быть признаком уязвимости.

source: More information about the error should be found in the server logs.
ru: Более подробную информацию об ошибке следует найти в логах сервера.

source: HTTP Methods
ru: HTTP-методы

source: While GET and POST are by far the most common methods that are used to access information provided by a web server, HTTP allows several other (and somewhat less known) methods.
ru: Хотя GET и POST на сегодняшний день являются наиболее распространенными методами, которые используются для доступа к информации, предоставляемой веб-сервером, HTTP позволяет использовать некоторые другие (и менее известные) методы.

source: Some of these can be used for nefarious purposes if the web server is misconfigured.
ru: Некоторые из них могут использоваться в низких целях, если веб-сервер неправильно настроен.

source: Unvalidated redirects and forwards are possible when a web application accepts untrusted input that could cause the web application to redirect the request to a URL contained within untrusted input.
ru: Непроверенные перенаправления и переадресации возможны, когда веб-приложение принимает ненадежные входные данные, что может привести к тому, что веб-приложение перенаправит запрос на URL-адрес, содержащийся в ненадежных входных данных.

source: By modifying untrusted URL input to a malicious site, an attacker may successfully launch a phishing scam and steal user credentials.
ru: Изменяя ввод ненадежного URL-адреса вредоносного сайта, злоумышленник может успешно запустить фишинговое мошенничество и украсть учетные данные пользователя.

source: Force all redirects to first go through a page notifying users that they are going off of your site, and have them click a link to confirm.
ru: Заставьте все перенаправления сначала пройти через страницу, уведомляющую пользователей о том, что они уходят с вашего сайта, и попросите их щелкнуть ссылку для подтверждения.

source: Resource consumption
ru: Потребление ресурсов

source: It took an abnormal time to the server to respond to a query.
ru: Серверу потребовалось аномальное время, чтобы ответить на запрос.

source: An attacker might leverage this kind of weakness to overload the server.
ru: Злоумышленник может использовать эту уязвимость для перегрузки сервера.

source: The involved script is maybe using the server resources (CPU, memory, network, file access...) in a non-efficient way.
ru: Возможно, задействованный сценарий использует ресурсы сервера (ЦП, память, сеть, доступ к файлам ...) неэффективным способом.

source: Secure Flag cookie
ru: Флаг Secure cookie

source: The secure flag is an option that can be set by the application server when sending a new cookie to the user within an HTTP Response.
ru: Флаг безопасности (Secure) - это параметр, который может быть установлен сервером при отправке нового файла cookie пользователю в HTTP-ответе.

source: The purpose of the secure flag is to prevent cookies from being observed by unauthorized parties due to the transmission of a the cookie in clear text.
ru: Целью флага безопасности является предотвращение просмотра файлов cookie неавторизованными сторонами из-за передачи файлов cookie в виде открытого текста.

source: When generating the cookie, make sure to set the Secure Flag to True.
ru: При создании файла cookie убедитесь, что для параметра Secure установлено значение True.

source: SQLI
ru: SQL инъекции

source: SQL injection vulnerabilities allow an attacker to alter the queries executed on the backend database.
ru: Уязвимости SQL-инъекций позволяют злоумышленнику изменять запросы, выполняемые в базе данных.

source: An attacker may then be able to extract or modify information stored in the database or even escalate his privileges on the system.
ru: Затем злоумышленник может извлечь или изменить информацию, хранящуюся в базе данных, или даже повысить свои привилегии в системе.

source: To protect against SQL injection, user input must not directly be embedded in SQL statements.
ru: Для защиты от SQL-инъекции вводимые пользователем данные не должны напрямую встраиваться в операторы SQL.

source: Instead, user input must be escaped or filtered or parameterized statements must be used.
ru: Вместо этого пользовательский ввод должен быть экранирован или отфильтрован, или должны использоваться параметризованные операторы.

source: Server Side Request Forgery
ru: Подделка запросов на стороне сервера

source: The target application may have functionality for importing data from a URL, publishing data to a URL or otherwise reading data from a URL that can be tampered with.
ru: Приложение может иметь функции для импорта данных из URL-адреса, добавление данных в URL-адрес или иного чтения данных из URL-адреса, которые могут быть изменены.

source: Every URI received by the web application should be checked, especially scheme and hostname. A whitelist should be used.
ru: Следует проверить каждый URI, полученный веб-приложением, особенно схему и имя хоста. Следует использовать белый список.

source: Subdomain takeover
ru: Захват субдомена

source: A DNS CNAME record points to a non existing domain or to a content that an attacker can take control of.
ru: Запись DNS CNAME указывает на несуществующий домен или на контент, который злоумышленник может получить под свой контроль.

source: Prevent dangling DNS entries by making sure you already have control over the pointed domain.
ru: Предотвратите появление висящих записей DNS, убедившись, что у вас уже есть контроль над указанным доменом.

source: Blind SQL Injection
ru: "Слепая" SQL инъекция

source: Blind SQLI
ru: "Слепая" SQL инъекция

source: Blind SQL injection is a technique that exploits a vulnerability occurring in the database of an application.
ru: "Слепая" SQL-инъекция - это метод, который использует уязвимость, возникающую в базе данных приложения.

source: This kind of vulnerability is harder to detect than basic SQL injections because no error message will be displayed on the webpage.
ru: Эту уязвимость сложнее обнаружить, чем простую SQL-инъекцию, потому что на веб-странице не будет отображаться сообщение об ошибке.

source: Cross Site Scripting
ru: Межсайтовый скриптинг

source: Cross-site scripting (XSS) is a type of computer security vulnerability typically found in web applications which allow code injection by malicious web users into the web pages viewed by other users.
ru: Межсайтовый скриптинг (XSS) - это тип уязвимости компьютерной безопасности, обычно обнаруживаемой в веб-приложениях, которые позволяют злоумышленникам внедрять код на веб-страницы, просматриваемые другими пользователями.

source: Examples of such code include HTML code and client-side scripts.
ru: Примеры такого кода включают HTML-код и клиентские скрипты.

source: The best way to protect a web application from XSS attacks is ensure that the application performs validation of all headers, cookies, query strings, form fields, and hidden fields.
ru: Лучший способ защитить веб-приложение от XSS-атак - убедиться, что приложение выполняет проверку всех заголовков, файлов cookie, строк запроса, полей формы и скрытых полей.
