Repository: dr1lan/custom-scanner
Catalog: wapitiCore/language_sources/*.po
Languages: ru

source: Encoding user supplied output in the server side can also defeat XSS vulnerabilities by preventing inserted scripts from being transmitted to users in an executable form.
ru: Кодирование вывода, предоставленного пользователем, на стороне сервера также может устранить уязвимости XSS, предотвращая передачу вставленных скриптов пользователям в исполняемой форме.

source: Applications can gain significant protection from javascript based attacks by converting the following characters in all generated output to the appropriate HTML entity encoding:
ru: Приложения могут получить значительную защиту от атак на основе javascript, преобразовав следующие символы во всех сгенерированных выводах в соответствующую кодировку объекта HTML:

source: XML External Entity
ru: Внешний объект XML

source: An XML External Entity attack is a type of attack against an application that parses XML input.
ru: Атака на внешний объект XML - это тип атаки на приложение, которое анализирует ввод XML.

source: This attack occurs when XML input containing a reference to an external entity is processed by a weakly configured XML parser.
ru: Эта атака происходит, когда ввод XML, содержащий ссылку на внешний объект, обрабатывается слабо настроенным синтаксическим анализатором XML.

source: This attack may lead to the disclosure of confidential data, denial of service, server side request forgery, port scanning from the perspective of the machine where the parser is located, and other system impacts.
ru: Эта атака может привести к раскрытию конфиденциальных данных, отказу в обслуживании, подделке запросов на стороне сервера, сканированию портов на устройстве, на котором расположен анализатор, и другим системным воздействиям.

source: The safest way to prevent XXE is always to disable DTDs (External Entities) completely.
ru: Самый безопасный способ предотвратить появление XXE - это всегда полностью отключать DTD (внешние сущности).

source: Evil url: {0}
ru: "Злой" URL: {0}

source: {0} in {1} via injection in the parameter {2}
ru: {0} в {1} посредством внедрения в параметр {2}

source: coming from {0}
ru: поступает из {0}

source: {0} in {1} via injection in the query string
ru: {0} в {1} посредством внедрения в строку запроса

source: {0} in {1} via injection in the resource path
ru: {0} in {1} с использованием инъекции в пути ресурса

source: Involved parameter: {0}
ru: Связанный параметр: {0}

source: Evil request:
ru: "Злой" запрос:

source: Received a HTTP 500 error in {0}
ru: Получена ошибка HTTP 500 в {0}

source: Timeout occurred in {0}
ru: Истекло время ожидания в {0}

source: The request timed out while attempting to inject a payload in the query string
ru: Истекло время ожидания запроса при попытке добавить нагрузку в строку запроса

source: The request timed out while attempting to inject a payload in the resource path
ru: Истекло время ожидания запроса при попытке добавить нагрузку в путь к ресурсу

source: The request timed out while attempting to inject a payload in the parameter {0}
ru: Истекло время ожидания запроса при попытке добавить нагрузку в параметр {0}

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the query string
ru: Сервер ответил кодом ошибки HTTP 500 при попытке добавить нагрузку в строку запроса

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the resource path
ru: Сервер ответил кодом ошибки HTTP 500 при попытке добавить нагрузку в путь к ресурсу

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the parameter {0}
ru: Сервер ответил кодом ошибки HTTP 500 при попытке добавить нагрузку в параметр {0}

source: Invalid argument for option {0} : {1}
ru: Недействительный аргумент для опции {0}: {1}

source: Use Tor listener (127.0.0.1:9050)
ru: Используется Tor (127.0.0.1:9050)

source: Set HTTP authentication credentials
ru: Установка учетных данных HTTP-аутентификации

source: Set the authentication type to use
ru: Установите тип аутентификации для использования

source: Set a custom user-agent to use for every requests
ru: Установите настраиваемый пользовательский агент, который будет использоваться для каждого запроса

source: Set a custom header to use for every requests
ru: Установите настраиваемый заголовок для использования для каждого запроса

source: Invalid base URL was specified, please give a complete URL with protocol scheme and slash after the domain name.
ru: Указан недопустимый базовый URL-адрес. Укажите полный URL-адрес со схемой протокола и косой чертой после имени домена.

source: Choose the form you want to use or enter 'q' to leave :
ru: Выберите форму, которую хотите использовать, или введите "q", чтобы выйти:

source: Enter a number :
ru: Введите номер:

source: Please enter values for the following form:
ru: Введите значения в следующую форму:

source: Waiting for running crawler tasks to finish, please wait.
ru: Ожидание завершения выполнения задач поискового робота, подождите.

source: Waiting for all payload tasks to finish for current resource, please wait.
ru: Ожидаем завершения всех задач полезной нагрузки для текущего ресурса, подождите.

source: [*] Loading modules:
ru: [*] Загрузка модулей:

source: [!] Could not find module {0}
ru: [!] Не удалось найти модуль {0}

source: [!] Unable to find a module named {0}
ru: [!] Невозможно найти модуль с именем {0}

source: Updating module {0}
ru: Обновление модуля {0}

source: Update done.
ru: Обновление выполнено.

source: [*] Saving scan state, please wait...
ru: [*] Сохранение состояния сканирования, подождите ...

source: Note
ru: Примечание

source: This scan has been saved in the file {0}
ru: Это сканирование сохранено в файле {0}

source: Max scan time was reached, stopping.
ru: Достигнуто максимальное время сканирования, останавливается.

source: [!] Missing dependencies for module {0}:
ru: [!] Отсутствуют зависимости для модуля {0}:

source: [*] Launching module {0}
ru: [*] Модуль запуска {0}

source: [*] {0} pages were previously attacked and will be skipped
ru: [*] {0} страницы ранее подвергались атаке и будут пропущены

source: Attack process was interrupted. Do you want to:
ru: Процесс атаки был прерван. Вы хотите:

source: r) stop everything here and generate the (R)eport
ru: r) остановить все здесь и сгенерировать отчет

source: n) move to the (N)ext attack module (if any)
ru: n) перейти к следующему модулю атаки (если есть)

source: q) (Q)uit without generating the report
ru: q) выйти без формирования отчета

source: c) (C)ontinue the current attack
ru: c) продолжить текущую атаку

source: Invalid choice. Valid choices are r, n, q and c.
ru: Неверный выбор. Допустимые варианты: r, n, q и c.

source: Max attack time was reached for module {0}, stopping.
ru: Достигнуто максимальное время атаки для модуля {0}, останавливается.

source: Sending crash report {} ... {}
ru: Отправка отчета о сбое {} ... {}

source: Error sending crash report
ru: Ошибка отправки отчета о сбое

source: {} requests were skipped due to network issues
ru: {} запросов было пропущено из-за проблем с сетью

source: Report
ru: Отчет

source: A report has been generated in the file {0}
ru: Отчет был создан в файле {0}

source: Open {0} with a browser to see this report.
ru: Откройте {0} в браузере, чтобы просмотреть этот отчет.

source: Error: {} must not contain params, query or fragment!
ru: Ошибка: {} не должен содержать параметров, запроса или фрагментов!

source: Error: {} must contain scheme and host
ru: Ошибка: {} должен содержать схему и хост

source: [*] You are lucky! Full moon tonight.
ru: [*] Тебе везет! Полнолуние сегодня вечером.

source: [*] Be careful! New moon tonight.
ru: [*] Будь осторожен! Новолуние сегодня вечером.

source: [*] Watch out! Bad things can happen on Friday the 13th.
ru: [*] Осторожно! В пятницу 13-го могут случиться неприятности.

source: [*] Today is International Beer Day!
ru: [*] Сегодня Международный день пива!

source: [*] May the force be with you!
ru: [*] Да прибудет с тобой сила!

source: [*] Happy new year!
ru: [*] С Новым Годом!

source: [*] Merry christmas!
ru: [*] Счастливого Рождества!

source: [*] Today is world backup day! Is your data safe?
ru: [*] Сегодня всемирный день резервного копирования! Ваши данные в безопасности?

source: The base URL used to define the scan scope (default scope is folder)
ru: Базовый URL-адрес, используемый для определения области сканирования (область по умолчанию - папка)

source: Set scan scope
ru: Установить область сканирования

source: List of modules to load
ru: Список модулей для загрузки

source: List Wapiti attack modules and exit
ru: Вывести список модулей атаки Wapiti и выйти

source: Update Wapiti attack modules and exit
ru: Обновите модули атаки Wapiti и выйдите

source: Set attack level
ru: Установить уровень атаки

source: Set the HTTP(S) proxy to use. Supported: http(s) and socks proxies
ru: Настройте прокси-сервер HTTP(S) для использования. Поддерживаются: http(s) и socks прокси

source: Set a JSON cookie file to use.
ru: Установите файл cookie JSON для использования.

source: You can also pass 'firefox' or 'chrome' to load cookies from your browser.
ru: Вы также можете передать «firefox» или «chrome», чтобы загружать файлы cookie из вашего браузера.

source: Ignore Set-Cookie header from HTTP responses
ru: Игнорировать заголовок Set-Cookie из HTTP-ответов

source: Don't resume the scanning process, attack URLs scanned during a previous session
ru: Не возобновлять процесс сканирования, атаковать URL-адреса, просканированные во время предыдущего сеанса

source: Resume the scanning process (if stopped) even if some attacks were previously performed
ru: Возобновить процесс сканирования (если он остановлен), даже если некоторые атаки были выполнены ранее

source: Flush attack history and vulnerabilities for the current session
ru: Очистить историю атак и уязвимостей для текущего сеанса

source: Flush everything that was previously found for this target (crawled URLs, vulns, etc)
ru: Удалите все, что было ранее найдено для этой цели (просканированные URL, уязвимости и т. Д.)

source: Directory where to store attack history and session data.
ru: Каталог, в котором хранится история атак и данные сеанса.

source: Directory where to store configuration databases.
ru: Каталог, в котором хранятся конфигурации баз данных.

source: Adds an url to start scan with
ru: Добавляет URL-адрес для начала сканирования

source: Adds an url to exclude from the scan
ru: Добавляет URL-адрес для исключения из сканирования

source: Remove this parameter from urls
ru: Удалить этот параметр из URL

source: Skip attacking given parameter(s)
ru: Пропустить атаку по заданным параметрам

source: Set how deep the scanner should explore the website
ru: Установите, насколько глубоко сканер должен исследовать веб-сайт

source: Set how many (in-scope) links the scanner should extract for each page
ru: Установите, сколько ссылок (в пределах области действия) сканер должен извлечь для каждой страницы

source: Set how many pages the scanner should explore per directory
ru: Установите, сколько страниц сканер должен исследовать для каждого каталога

source: Set how many seconds you want the scan to last (floats accepted)
ru: Установите, сколько секунд вы хотите, чтобы сканирование длилось (принимаются числа с плавающей точкой)

source: Set how many seconds you want each attack module to last (floats accepted)
ru: Установите, сколько секунд вы хотите, чтобы каждый модуль атаки работал (принимаются числа с плавающей точкой)

source: URLs and forms having more than MAX input parameters will be erased before attack.
ru: URL-адреса и формы, содержащие более MAX входных параметров, будут удалены перед атакой.

source: Easy way to reduce the number of scanned and attacked URLs. Possible values: paranoid, sneaky, polite, normal, aggressive, insane
ru: Простой способ уменьшить количество просканированных и атакованных URL-адресов. Возможные значения: параноик, подлый, вежливый, нормальный, агрессивный, безумный

source: Number of concurrent tasks to use for the exploration (crawling) of the target.
ru: Количество одновременных задач, используемых для исследования (обхода) цели.

source: Set timeout for requests
ru: Установить тайм-аут для запросов

source: Set SSL check (default is no check)
ru: Установить проверку SSL (по умолчанию проверка отсутствует)

source: Colorize output
ru: Подсветить вывод

source: Set verbosity level (0: quiet, 1: normal, 2: verbose)
ru: Установить уровень детализации (0: тихо, 1: нормально, 2: подробно)

source: Set output format. Supported:
ru: Установите выходной формат. Поддерживается:

source: Default is html.
ru: По умолчанию - html.

source: Output file or folder
ru: Выходной файл или папка

source: Output log file
ru: Выходной файл лога

source: Url serving as endpoint for target
ru: URL-адрес, служащий конечной точкой для цели

source: Url serving as endpoint for attacker
ru: URL-адрес, служащий конечной точкой для злоумышленника

source: Url serving as endpoint for both attacker and target
ru: URL-адрес, служащий конечной точкой как для злоумышленника, так и для цели

source: Don't send automatic bug report when an attack module fails
ru: Не отправлять автоматический отчет об ошибке при выходе из строя модуля атаки

source: Show program's version number and exit
ru: Показать номер версии программы и выйти

source: Number of concurrent tasks must be 1 or above!
ru: Количество одновременных задач должно быть не менее 1!

source: [*] Do you feel lucky punk?
ru: [*] Тебе повезло, панк?

source: [*] Available modules:
ru: [*] Доступные модули:

source: Invalid base URL was specified, please give a complete URL with protocol scheme.
ru: Указан недопустимый базовый URL-адрес. Укажите полный URL-адрес со схемой протокола.

source: [*] Updating modules
ru: [*] Обновление модулей

source: Error: File given with the -s option must be UTF-8 encoded !
ru: Ошибка: файл, указанный с параметром -s, должен быть в кодировке UTF-8!

source: Error: Internal endpoint URL must be accessible from Wapiti!
ru: Ошибка: внутренний URL-адрес конечной точки должен быть доступен из Wapiti!

source: [*] Resuming scan from previous session, please wait
ru: [*] Возобновление сканирования с предыдущего сеанса, подождите

source: [*] {0} URLs and forms having more than {1} parameters were removed.
ru: [*] {0} URL-адреса и формы, содержащие более {1} параметров, были удалены.

source: [*] Wapiti found {0} URLs and forms during the scan
ru: [*] Wapiti обнаружила {0} URL и формы во время сканирования

source: [!] Can't store information in persister. SQLite database must have been locked by another process
ru: [!] Не могу сохранить информацию. База данных SQLite должна быть заблокирована другим процессом

source: [!] You should unlock and launch Wapiti again.
ru: [!] Вам следует разблокировать и снова запустить Wapiti.

source: Login failed
ru: Авторизация не удалась

source: Invalid credentials format
ru: Неверный формат учетных данных

source: Login success
ru: Успешный вход в систему

source: Credentials might be invalid
ru: Учетные данные могут быть недействительными

source: No login form detected
ru: Форма входа не обнаружена

source: [!] Connection error with URL
ru: [!] Ошибка подключения с URL

source: [!] {} with url {}
ru: [!] {} с URL {}

source: Report for {0}
ru: Отчет за {0}

source: Date of the scan : {0}
ru: Дата сканирования: {0}

source: Scope of the scan : {0}
ru: Объем сканирования: {0}

source: Summary of vulnerabilities :
ru: Сводка уязвимостей:

source: Evil request:
ru: "Злой" запрос:

source: cURL command PoC : "{0}"
ru: cURL комманда PoC : "{0}"

source: Summary of anomalies :
ru: Сводка аномалий:

source: Summary of additionals :
ru: Сводка дополнений:
